package curriculum_A;

public class Qes1_13 {
	public static void main(String[] args) {
		/**********************************************************************************								
		* [概要] ローカル変数宣言							
		* [詳細] ローカル変数の宣言、値の代入			
		**********************************************************************************/

		/*-------------------------------------------------------------------------							
		[概要] 問題1と2の解答							
		-------------------------------------------------------------------------*/
		// バイト型の変数宣言、初期値を設定
		byte num1 = 0;
		// 短整数型の変数宣言、初期値を設定
		short num2 = 0;
		// 整数型の変数宣言、初期値を設定
		int num3 = 0;
		// 長整数型の変数宣言、初期値を設定
		long num4 = 0L;
		// 単精度浮動小数点型の変数宣言、初期値を設定
		float num5 = 0.0f;
		// 倍精度浮動小数点型の変数宣言、初期値を設定
		double num6 = 0.0d;
		// 文字型の変数宣言、初期値を設定
		char text1 = '\u0000';
		// 文字列型の変数宣言、初期値を設定
		String text2 = null;
		// ブーリアン型の変数宣言、初期値を設定
		boolean check = false;

		/*-------------------------------------------------------------------------							
		[概要] 問題3の解答							
		-------------------------------------------------------------------------*/
		// バイト型の変数に値の代入
		num1 = 10;
		// 短整数型の変数に値の代入
		num2 = 100;
		// 整数型の変数に値の代入
		num3 = 1000;
		// 長整数型の変数に値の代入
		num4 = 10000;
		// 単精度浮動小数点型の変数に値の代入
		num5 = 9.5f;
		// 倍精度浮動小数点型の変数に値の代入
		num6 = 10.5;
		// 文字型の変数に値の代入
		text1 = 'a';
		// 文字列型の変数に値の代入
		text2 = "ハロー";
		// ブーリアン型の変数に値の代入
		check = true;

		/*-------------------------------------------------------------------------							
		[概要] 問題4の解答							
		-------------------------------------------------------------------------*/
		// 11110をコンソールに出力
		System.out.println(num1 + num2 + num3 + num4);
		// 20をコンソールに出力
		System.out.println(num1 + num1);
		// aハローtrueをコンソールに出力
		System.out.println(text1 + text2 + check);
		// 11130をコンソールに出力
		System.out.println(num1 + num1 + num1 + num2 + num3 + num4);
		// 10000000000をコンソールに出力
		System.out.println(num1 * num2 * num3 * num4);
		// 0.105をコンソールに出力
		System.out.println(num6 / num2);
		// -90をコンソールに出力
		System.out.println(num1 - num2);

		/*-------------------------------------------------------------------------							
		[概要] 問題5の解答							
		-------------------------------------------------------------------------*/
		// 整数型の変数宣言、初期値を設定
		int num7 = 20;
		// 整数型の変数宣言、初期値を設定
		int num8 = 23;
		// ハローJAVA43をコンソールに出力
		System.out.println("ハローJAVA" + (num7 + num8));

		/*-------------------------------------------------------------------------							
		[概要] 問題6の解答							
		-------------------------------------------------------------------------*/
		// 文字列型の変数宣言、初期値を設定
		String name = "";
		// 変数に値の代入
		name = "山田太郎";
		// 整数型の変数宣言、初期値を設定
		int age = 0;
		// 変数に値の代入
		age = 18;
		// 倍精度浮動小数点型の変数宣言、初期値を設定
		double height = 0.0f;
		// 変数に値の代入
		height = 170.5;
		// 倍精度浮動小数点型の変数宣言、初期値を設定
		double weight = 0.0f;
		// 変数に値の代入
		weight = 62.2;
		// 文字列型の変数宣言、初期値を設定
		String food = "";
		// 変数に値の代入
		food = "寿司";
		
		// コンソールに出力
		System.out.println("初めまして" + name + "です");
		System.out.println("年齢は" + age + "歳です");
		System.out.println("身長は" + height + "cmです");
		System.out.println("体重は" + weight + "kgです");
		System.out.println("好きな食べ物は" + food + "です");

		/*-------------------------------------------------------------------------							
		[概要] 問題7の解答							
		-------------------------------------------------------------------------*/
		// コンソールにBMIを計算して出力、表示桁数の調整
		System.out.println("BMIは" + String.format("%.1f", weight / ((height / 100) * (height / 100))) + "です");

		/*-------------------------------------------------------------------------							
		[概要] 問題8の解答,問題10の解答,問題11の解答,問題12の解答,	問題13の解答				
		-------------------------------------------------------------------------*/
		// 変数に値の再代入
		name = "鈴木一郎";
		age = 24;
		height = 168.5;
		weight = 64.2;
		food = "オムライス";
		
		// コンソールに出力
		System.out.println("初めまして" + name + "です");
		System.out.println("年齢は" + age + "歳です");
		System.out.println("身長は" + height + "cmです");
		System.out.println("体重は" + weight + "kgです");
		System.out.println("好きな食べ物は" + food + "です");
		// コンソールにBMIを計算して出力、表示桁数の調整
		System.out.println("BMIは" + String.format("%.1f", weight / ((height / 100) * (height / 100))) + "です");
		
		// ブーリアン型の変数宣言、ageが25以上ならtrueを代入
		boolean b = age >= 25 ? true : false;
		// コンソールに出力
		System.out.println(b);
		
		// 文字列型に型変換
		String age2 = String.valueOf(age);
		String weight2 = String.valueOf(weight);
		String height2 = String.valueOf(height);
		// コンソールに繋げて出力
		System.out.println(age2 + weight2 + height2);
		
		// 整数型に型変換
		int age3 = Integer.parseInt(age2);
		double height3 = Double.parseDouble(height2);
		// コンソールに出力
		System.out.println(age3);
		System.out.println(height3);
		
		// ブーリアン型の変数宣言、age3が25もしくはheight3が160以上ならtrueを代入
		boolean b2 = age3 == 25 || height3 >= 160 ? true : false;
		// コンソールに出力
		System.out.println(b2);
		/*-------------------------------------------------------------------------							
		[概要] 問題9の解答							
		-------------------------------------------------------------------------*/
		// 変数に値の自己代入
		age = age + 24;
		height = height + 168.5;
		weight = weight + 64.2;
		
		// コンソールに出力
		System.out.println("初めまして" + name + "です");
		System.out.println("年齢は" + age + "歳です");
		System.out.println("身長は" + height + "cmです");
		System.out.println("体重は" + weight + "kgです");
		System.out.println("好きな食べ物は" + food + "です");
		// コンソールにBMIを計算して出力、表示桁数の調整
		System.out.println("BMIは" + String.format("%.2f", weight / ((height / 100) * (height / 100))) + "です");
	}
}
